app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello\r\n"], ["user_id", 1], ["created_at", "2016-03-06 09:52:44.310089"], ["updated_at", "2016-03-06 09:52:44.310089"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save